app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "aldsfj"], ["text", "asldkjfad"], ["created_at", "2017-05-23 02:32:48.916929"], ["updated_at", "2017-05-23 02:32:48.916929"]]
---
  def create
    @post = Post.new(params.require(:post).permit(:title, :text))

    if @post.save